04_OpenFoam/_Tut_02/OpenFOAM-14/compressibleVoF/depthCharge2D/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField
{
    type        surfaces;

    defaultValue 1e5;

    surfaces
    {
        bubble
        {
            type        cylinder;

            point1      (0.5 0.5 -1);
            point2      (0.5 0.5 1);
            radius      0.1;

            value       1e6;
        }
    }
}

boundaryField
{
    walls
    {
        type            fixedFluxPressure;
    }

    defaultFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
